_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыМатериалов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПроекту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Учтенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУчтенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МестныйМатериал</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВидыРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВидыРесурсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗатратыТрудаРабочих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗатратыТрудаМашинистов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МашиныИМеханизмы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перебазировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВидыРасценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВидыРасценки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МебельИнвентарь</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_МетодыРасчетаЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_МетодыРасчетаЛС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БазисноИндексный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ресурсный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВариантыРасчетаЗМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВариантыРасчетаЗМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Расчетный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Усредненный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыРайонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыРайонов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приравнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Относится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОтносится</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыСтроительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыСтроительства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НовоеСтроительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапитальныйРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДорожноеСтроительство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_УровеньЗаданияИндексов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_УровеньЗаданияИндексов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Расценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Раздел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Смета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_СпособыРасчетаИндексов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_СпособыРасчетаИндексов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КПолнойСтоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЭлементамЗатрат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВариантыПересчетаЭММ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВариантыПересчетаЭММ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Одинаковые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазныеКРазности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonModules/СМ_СметаКлиентСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Сметная подсистема".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает индекс картинки для ресурса.
//
// Параметры:
//     ТипРесурса - ПеречсилениеСсылка.СМ_ТипыМатериалов - тип ресурса.
//     ВидРесурса - ПеречсилениеСсылка.СМ_ВидыРесурсов - вид ресурса.
//
// Возвращаемое значение:
//     Число - Индекс картинки СМ_Ресурсы.
//
Функция ПолучитьКартинкуРесурса(ТипРесурса, ВидРесурса) Экспорт
	
	Если (ТипРесурса = ПредопределенноеЗначение("Перечисление.СМ_ТипыМатериалов.Учтенный")) Тогда
		Если ВидРесурса = ПредопределенноеЗначение("Перечисление.СМ_ВидыРесурсов.ЗатратыТрудаМашинистов") Тогда
			Возврат 1;
		ИначеЕсли ВидРесурса = ПредопределенноеЗначение("Перечисление.СМ_ВидыРесурсов.ЗатратыТрудаРабочих") Тогда
			Возврат 0;
		ИначеЕсли ВидРесурса = ПредопределенноеЗначение("Перечисление.СМ_ВидыРесурсов.Оборудование") Тогда
			Возврат 5;
		ИначеЕсли (ВидРесурса = ПредопределенноеЗначение("Перечисление.СМ_ВидыРесурсов.МашиныИМеханизмы"))или
			(ВидРесурса = ПредопределенноеЗначение("Перечисление.СМ_ВидыРесурсов.Перебазировка"))или
			(ВидРесурса = ПредопределенноеЗначение("Перечисление.СМ_ВидыРесурсов.Транспортировка")) Тогда
			Возврат 2;
		Иначе
			Возврат 3;
		КонецЕсли;
	Иначе
		Возврат 4;
	КонецЕсли;
	
КонецФункции

// Проверяет заполненность региона.
//
// Возвращаемое значение:
//     Результат - Структура - содержит поле "Регион" (СправочникСсылка.СМ_Регионы) или Булево (Ложь, если не найдено).
//
Функция ПроверкаРегиона() Экспорт
	Возврат СМ_СметаОбновлениеВызовСервера.ПроверяемРегионОбработка();
КонецФункции

// Проверяет доступность ролей из списка
//
// Параметры:
//     	СписокРолей - Строка - имена ролей, разделенные запятыми, доступность которых проверяется.
//
// Возвращаемое значение:
// 		Результат - Булево - Истина, если хотя бы одна из указанных ролей доступна или
//           				 функция ЭтоПолноправныйПользователь(Пользователь) возвращает Истина.
//
Функция РолиДоступныПроверка(СписокРолей) Экспорт
	Возврат	СМ_СметаВызовСервера.РолиДоступныПроверка(СписокРолей);
КонецФункции

// Рассчитывает количество ресурса для позиции.
//
// Параметры:
//     Объект - ДокументОбъект.СМ_ПозицияЛокальнойСметы - позция или данные формы, которые обрабатываются.
//
Процедура РассчитатьКоличествоРесурса(Объект) Экспорт
	                	
	ВидРасценки = СМ_СметаВызовСервера.ПолучитьЗначениеРеквизита(Объект.Определитель,"ВидРасценки");
	Если ВидРасценки = ПредопределенноеЗначение("Перечисление.СМ_ВидыРасценки.Работа") Тогда
		Объект.НормаРасходаРесурса 	= 1; 
		Объект.КоличествоРесурса 	= Объект.ОбъемРабот;
	Иначе
		Если Объект.НормаРасходаРесурса > 0 Тогда
			Объект.КоличествоРесурса = Объект.ОбъемРабот / Объект.НормаРасходаРесурса;
		Иначе
			Объект.КоличествоРесурса = 0;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область РаботаСФормулами

// Получает список параметров из строки формулы
//
// Параметры:
//     СтрокаФормулы - Строка - строка содержащая формулу.
//
// Возвращаемое значение:
// 		МассивПараметров - Массив - содержит параметры формулы.
//
Функция ПолучитьСписокПараметровФормулы(СтрокаФормулы) Экспорт

	МассивСимволовЗамены = Новый Массив;
	МассивСимволовЗамены.Добавить("+");	
	МассивСимволовЗамены.Добавить("-");
	МассивСимволовЗамены.Добавить("/");
	МассивСимволовЗамены.Добавить("*");
	МассивСимволовЗамены.Добавить(" ");
	МассивСимволовЗамены.Добавить("(");
	МассивСимволовЗамены.Добавить(")");
	МассивСимволовЗамены.Добавить(".");
	МассивСимволовЗамены.Добавить(",");
	
	СтрокаПоиска = СтрокаФормулы;
	Для Каждого ТекЭлемент Из МассивСимволовЗамены Цикл
		ТекСтрока 		= СтрЗаменить(СтрокаПоиска,ТекЭлемент,";"); 
		СтрокаПоиска 	= ТекСтрока;
	КонецЦикла;

	МассивСтроки 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекСтрока,";",Истина,Истина);
	МассивПараметров 	= Новый Массив;
	ЕстьПараметры 		= Ложь;
	Для Каждого ТекЭлемент Из МассивСтроки Цикл
		ТолькоЦифры = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ТекЭлемент,Истина,Ложь);
		Если Не ТолькоЦифры Тогда
			МассивПараметров.Добавить(ТекЭлемент);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивПараметров;
	
КонецФункции

// Заполняет значения параметров в структуре
//
// Параметры:
// 		МассивПараметров 	- Массив - содержит параметры сметы.
//		ЛокальнаяСмета 		- ДокументСсылка.СМ_ЛокальнаяСмета - ссылка на локальную смету.
//
// Возвращаемое значение:
// 		Структура - содержит параметры локальной сметы.
//
Функция ЗаполнитьЗначенияПараметров(МассивПараметров,ЛокальнаяСмета) Экспорт 
	
	СтруктураПараметров = Новый Структура;
	ТабПараметры = ЛокальнаяСмета.Параметры;
	Для Каждого ТекЭлемент Из МассивПараметров Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ИмяПараметра",ТекЭлемент);
		МассивСтрок = ТабПараметры.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрок.Количество() > 0 Тогда
			НайденнаяСтрока = МассивСтрок[0];
			СтруктураПараметров.Вставить(НайденнаяСтрока.ИмяПараметра,НайденнаяСтрока.ЗначениеПараметра);	
		Иначе
			ТекстСообщения 	= "Не найден параметр формулы: " + ТекЭлемент;
			Сообщение 		= Новый СообщениеПользователю();
		    Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураПараметров;
	
КонецФункции

// Подставляет параметры в строку формулы
//
// Параметры:
//     СтрокаФормулы 		- Строка - строка содержащая формулу.
//	   СтруктураПараметров 	- Структура - содержит параметры формулы.
//
// Возвращаемое значение:
// 		Строка - содержит формулу с заполненными параметрами.
//
Функция ПодставитьПараметрыВФормулу(СтрокаФормулы, СтруктураПараметров) Экспорт
	
	Для Каждого ТекПараметр Из СтруктураПараметров Цикл
		СтрокаФормулы = СтрЗаменить(СтрокаФормулы,ТекПараметр.Ключ,ТекПараметр.Значение); 
	КонецЦикла;
	
	Возврат СтрокаФормулы;
	
КонецФункции

#КонецОбласти

#Область ОграниченияПоМетодикамРасчета

// Заполняет указанные реквизиты значениями по умолчанию в зависимости от методики расчета.
//
// Параметры:
//     	МетодикаРасчета - СправочникСсылка.СМ_МетодикиРасчета - методика расчета. 
//		СметаОбъект		- ДокументОбъект.СМ_ЛокальнаяСмета - смета, для которой заполняются значения по умолчанию.
//
Процедура ЗаполнитьРеквизитыПоУмолчанию(СметаОбъект, МетодикаРасчета) Экспорт

	ЗначенияПоУмолчанию = Новый Структура;
	
	Если СметаОбъект.Ссылка.Пустая() Тогда
		
			// Значения по умолчанию для методики "РСНБ Республики Казахстан"
		Если МетодикаРасчета = ПредопределенноеЗначение("Справочник.СМ_МетодикиРасчета.СМ_КЗ_РСНБ") Тогда
			// Пример:
			// ЗначенияПоУмолчанию.Вставить("МетодРасчета",ПредопределенноеЗначение("Перечисление.СМ_МетодыРасчетаЛС.Ресурсный"));	
			ЗначенияПоУмолчанию.Вставить("МетодРасчета",ПредопределенноеЗначение("Перечисление.СМ_МетодыРасчетаЛС.Ресурсный"));
			ЗначенияПоУмолчанию.Вставить("ВариантРасчетаЗМ",ПредопределенноеЗначение("Перечисление.СМ_ВариантыРасчетаЗМ.Расчетный"));
			ЗначенияПоУмолчанию.Вставить("ТипРайона",ПредопределенноеЗначение("Перечисление.СМ_ТипыРайонов.НеОтносится"));
			ЗначенияПоУмолчанию.Вставить("ТипСтроительства",ПредопределенноеЗначение("Перечисление.СМ_ТипыСтроительства.НовоеСтроительство")); 			   		
			// Значения по умолчанию для методики 84 года
		ИначеЕсли МетодикаРасчета = ПредопределенноеЗначение("Справочник.СМ_МетодикиРасчета.СМ_Методика84года") Тогда
			
			ЗначенияПоУмолчанию.Вставить("РасчетНРиСПотПЗ",Ложь);
			ЗначенияПоУмолчанию.Вставить("БезПримененияКоэффициентов",Ложь);
		
			// Значения по умолчанию для методики МДС35-2001	
		ИначеЕсли МетодикаРасчета = ПредопределенноеЗначение("Справочник.СМ_МетодикиРасчета.СМ_МетодикаМДС35") Тогда
			
			// Значения по умолчанию для методики ТСН г.Москва
		ИначеЕсли МетодикаРасчета = ПредопределенноеЗначение("Справочник.СМ_МетодикиРасчета.СМ_МетодикаТСНГородаМосква") Тогда
			ЗначенияПоУмолчанию.Вставить("МетодРасчета",ПредопределенноеЗначение("Перечисление.СМ_МетодыРасчетаЛС.БазисноИндексный"));
			ЗначенияПоУмолчанию.Вставить("Уровень",ПредопределенноеЗначение("Перечисление.СМ_УровеньЗаданияИндексов.Расценка"));
			ЗначенияПоУмолчанию.Вставить("СпособРасчетаИндексов",ПредопределенноеЗначение("Перечисление.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат"));
			ЗначенияПоУмолчанию.Вставить("ВариантПересчетаЭММ",ПредопределенноеЗначение("Перечисление.СМ_ВариантыПересчетаЭММ.Одинаковые"));  			
		КонецЕсли;	
		
	КонецЕсли;

	// Применение настроек
	Для Каждого ТекСтрока Из ЗначенияПоУмолчанию Цикл
		СметаОбъект[ТекСтрока.Ключ] = ТекСтрока.Значение;
	КонецЦикла;
	
КонецПроцедуры	

// Устанавливает видимость / доступность элементов формы в зависимости от методики расчета.
//
// Параметры:
//     	МетодикаРасчета - СправочникСсылка.СМ_МетодикиРасчета - методика расчета.
//		ФормаСметы		- УправляемаяФорма - форма сметы, для которой устанавливает видимость / доступность реквизитов.
//
Процедура НастройкиВидимостиДоступности(ФормаСметы, МетодикаРасчета) Экспорт
	
	// Пример:
	// Ограничения по видимости реквизитов
	// НастройкиВидимости.Вставить("СтраницаМетодикаТСН",Ложь);
	// НастройкиВидимости.Вставить("Группа1984",Истина);
	
	// Ограничения по доступности реквизитов
	// НастройкиДоступности.Вставить("СтраницаМетодикаТСН",Ложь);
	// НастройкиДоступности.Вставить("БазисныеЦены",Истина);

	НастройкиВидимости		= Новый Структура;	
	НастройкиДоступности	= Новый Структура;
	
	// Для методики "РСНБ Республики Казахстан"
	Если МетодикаРасчета = ПредопределенноеЗначение("Справочник.СМ_МетодикиРасчета.СМ_КЗ_РСНБ") Тогда
		
		НастройкиВидимости.Вставить("ТипСтроительства",Ложь);
		НастройкиВидимости.Вставить("ТипРайона",Ложь);
		НастройкиВидимости.Вставить("РеконструкцияАЭС",Ложь);
		НастройкиВидимости.Вставить("УпрощеннаяСН",Ложь);
		НастройкиВидимости.Вставить("ПрименятьКоэффициентыНРСП",Ложь);
		НастройкиВидимости.Вставить("Уровень",Ложь);
		НастройкиВидимости.Вставить("ВариантПересчетаЭММ",Ложь);
		НастройкиВидимости.Вставить("СпособРасчетаИндексов",Ложь);
		НастройкиВидимости.Вставить("ВариантРасчетаЗМ",Ложь);
		НастройкиВидимости.Вставить("Методика1984",Ложь);
		НастройкиВидимости.Вставить("РасчетНРиСПотПЗ",Ложь);
		НастройкиВидимости.Вставить("БезПримененияКоэффициентов",Ложь);
		НастройкиВидимости.Вставить("Коэффициенты",Ложь);
		НастройкиВидимости.Вставить("Группа1984",Ложь);
		НастройкиВидимости.Вставить("ГруппаРСНБКазахстана",Истина);
		НастройкиВидимости.Вставить("ГруппаАвтозагрузка",Истина);
		
		// Ранжирование
		НастройкиВидимости.Вставить("СтраницаРанжирование",Ложь);
		НастройкиВидимости.Вставить("ДеревоЛСРанжированиеРесурсов",Ложь);
		
		НастройкиДоступности.Вставить("МетодРасчета",Ложь);
				
	// Для методики 84 года
	ИначеЕсли МетодикаРасчета = ПредопределенноеЗначение("Справочник.СМ_МетодикиРасчета.СМ_Методика84года") Тогда
	
	    НастройкиВидимости.Вставить("ГруппаРСНБКазахстана",Ложь);
		НастройкиВидимости.Вставить("Группа1984",Ложь);
		НастройкиВидимости.Вставить("ГруппаАвтозагрузка",Ложь);
		НастройкиВидимости.Вставить("СтраницаРанжирование",Ложь);
		
		// Ранжирование
		НастройкиВидимости.Вставить("СтраницаРанжирование",Ложь);
		НастройкиВидимости.Вставить("ДеревоЛСРанжированиеРесурсов",Ложь);
	
		НастройкиДоступности.Вставить("РасчетНРиСПотПЗ",Ложь);
		НастройкиДоступности.Вставить("БезПримененияКоэффициентов",Ложь);
		НастройкиДоступности.Вставить("Методика1984",Ложь);
		
	// Для методики МДС35-2001	
	ИначеЕсли МетодикаРасчета = ПредопределенноеЗначение("Справочник.СМ_МетодикиРасчета.СМ_МетодикаМДС35") Тогда
		
		НастройкиВидимости.Вставить("ГруппаРСНБКазахстана",Ложь);
		НастройкиВидимости.Вставить("Группа1984",Ложь);
		НастройкиВидимости.Вставить("ГруппаАвтозагрузка",Истина);
		
		// Ранжирование
		НастройкиВидимости.Вставить("СтраницаРанжирование",Ложь);
		НастройкиВидимости.Вставить("ДеревоЛСРанжированиеРесурсов",Ложь);
		
	// Для методики ТСН г.Москва
	ИначеЕсли МетодикаРасчета = ПредопределенноеЗначение("Справочник.СМ_МетодикиРасчета.СМ_МетодикаТСНГородаМосква") Тогда
	
	    НастройкиВидимости.Вставить("ГруппаРСНБКазахстана",Ложь);
		НастройкиВидимости.Вставить("Группа1984",Ложь);
		НастройкиВидимости.Вставить("ГруппаАвтозагрузка",Истина);
		
		// Ранжирование
		НастройкиВидимости.Вставить("СтраницаРанжирование",Ложь);
		НастройкиВидимости.Вставить("ДеревоЛСРанжированиеРесурсов",Ложь);
		
	// Для методики МДС 2017
	ИначеЕсли МетодикаРасчета = ПредопределенноеЗначение("Справочник.СМ_МетодикиРасчета.СМ_МетодикаМДС2017") Тогда
		
		// Ранжирование
		НастройкиВидимости.Вставить("СтраницаРанжирование",Истина);
		НастройкиВидимости.Вставить("ДеревоЛСРанжированиеРесурсов",Истина);
		
	КонецЕсли;		
	
	Для Каждого ТекСтрока Из НастройкиВидимости Цикл
		ФормаСметы.Элементы[ТекСтрока.Ключ].Видимость = ТекСтрока.Значение;	
	КонецЦикла;
	
	Для Каждого ТекСтрока Из НастройкиДоступности Цикл
		ФормаСметы.Элементы[ТекСтрока.Ключ].Доступность = ТекСтрока.Значение;		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет корректность заполнения реквизитов сметы, в зависимости от методики расчета.
//
// Параметры:
//     	МетодикаРасчета - СправочникСсылка.СМ_МетодикиРасчета - методика расчета.
//		СметаОбъект		-  ДокументОбъект.СМ_ЛокальнаяСмета - смета, для которой производится проверка значений реквизитов.
//
// Возвращаемое значение:
// 		Результат - Массив - содержит информацию об ошибках заполнения реквизитов.
//
Функция ПроверитьКорректностьЗаполненныхРеквизитов(СметаОбъект, МетодикаРасчета) Экспорт
	
	ЗапрещенныеЗначения = Новый Структура;	

		// Для методики "РСНБ Республики Казахстан"
	Если МетодикаРасчета = ПредопределенноеЗначение("Справочник.СМ_МетодикиРасчета.СМ_КЗ_РСНБ") Тогда
		
		ЗапрещенныеЗначения.Вставить("МетодРасчета",ПредопределенноеЗначение("Перечисление.СМ_МетодыРасчетаЛС.БазисноИндексный"));
		ЗапрещенныеЗначения.Вставить("ТипРайона",ПредопределенноеЗначение("Перечисление.СМ_ТипыРайонов.Приравнен"));
			
		// Для методики 84 года
	ИначеЕсли МетодикаРасчета = ПредопределенноеЗначение("Справочник.СМ_МетодикиРасчета.СМ_Методика84года") Тогда
			
		// Для методики МДС35-2001	
	ИначеЕсли МетодикаРасчета = ПредопределенноеЗначение("Справочник.СМ_МетодикиРасчета.СМ_МетодикаМДС35") Тогда
		
		// Для методики ТСН г.Москва
	ИначеЕсли МетодикаРасчета = ПредопределенноеЗначение("Справочник.СМ_МетодикиРасчета.СМ_МетодикаТСНГородаМосква") Тогда
	
		ЗапрещенныеЗначения.Вставить("МетодРасчета",ПредопределенноеЗначение("Перечисление.СМ_МетодыРасчетаЛС.Ресурсный"));
		ЗапрещенныеЗначения.Вставить("ТипРайона",ПредопределенноеЗначение("Перечисление.СМ_ТипыРайонов.Приравнен"));
		
	КонецЕсли;	

	МассивСообщенийОбОшибках = Новый Массив;
	Для Каждого ТекСтрока Из ЗапрещенныеЗначения Цикл
		Если СметаОбъект[ТекСтрока.Ключ] = ТекСтрока.Значение Тогда
			МассивСообщенийОбОшибках.Добавить(НСтр("ru='Значение реквизита " + ТекСтрока.Ключ + " не соответствует выбранной в смете методике'"));	
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивСообщенийОбОшибках;
	
КонецФункции

#КонецОбласти

#КонецОбласти
